posts/2019-09-27-standalone-chocolatey-installer/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creating a Standalone Offline Chocolatey Installer</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Creating a Standalone Offline Chocolatey Installer</h1>
</header><p>
The <a href="https://chocolatey.org/docs/installation#why-isnt-there-an-msi">Chocolatey install documentation</a> includes a section about why there isn't an
MSI to install Chocolatey. In case that you are still searching for an
executable, this post outlines a way to create your own "setup" using a self
extracting <a href="https://www.7-zip.org/">7-zip</a> archive. We'll need the following directory structure:
</p>

<ul class="org-ul">
<li><code>config.txt</code>: A 7-zip configuration file</li>
<li><code>install.bat</code>: A wrapper script to call <code>install.ps1</code></li>
<li><code>install.ps1</code>: This script will perform the actual installation inside the
7-zip archive</li>
<li><code>build.ps1</code>: The script which will create our target file <code>output/chocolateySetup.exe</code></li>
</ul>

<div id="outline-container-orgff5d914" class="outline-2">
<h2 id="orgff5d914">config.txt</h2>
<div class="outline-text-2" id="text-orgff5d914">
<p>
We're using a rather simple configuration, which will:
</p>

<ul class="org-ul">
<li>Show the user a "Do you want to install Chocolatey?" yes/no prompt</li>
<li>Run <code>install.bat</code> after extracting the archive</li>
</ul>

<p>
The <a href="https://sevenzip.osdn.jp/chm/cmdline/switches/sfx.htm">7-zip SFX documentation</a> outlines all available format options of a
<code>config.txt</code> file.
</p>

<div class="org-src-container">
<pre class="src src-text">;!@Install@!UTF-8!
Title="Chocolatey"
BeginPrompt="Do you want to install Chocolatey?"
ExecuteFile="install.bat"
;!@InstallEnd@!
</pre>
</div>
</div>
</div>

<div id="outline-container-org3269488" class="outline-2">
<h2 id="org3269488">install.bat</h2>
<div class="outline-text-2" id="text-org3269488">
<p>
<code>install.bat</code> is a simple wrapper script which calls <code>install.ps1</code>. I found this
to be more convenient than trying to let the 7-zip SFX module call PowerShell
directly.
</p>

<div class="org-src-container">
<pre class="src src-cmd">@ECHO OFF
PowerShell.exe -NoProfile -ExecutionPolicy Bypass -Command "&amp; '%~dpn0.ps1'"
PAUSE
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b280ae" class="outline-2">
<h2 id="org5b280ae">install.ps1</h2>
<div class="outline-text-2" id="text-org5b280ae">
<p>
This script performs the actual installation by calling Chocolatey's
<code>chocolateyInstall.ps1</code>.
</p>

<div class="org-src-container">
<pre class="src src-powershell">if ($env:ChocolateyInstall) {
    Write-Warning 'Chocolatey is already installed!'
    return
}

$env:ChocolateyInstall = "$($env:ProgramData)\chocolatey"

$root = if ($PSScriptRoot) { $PSScriptRoot } else { Split-Path -Path $psISE.CurrentFile.FullPath }

&amp; (Join-Path $root 'chocolatey\tools\chocolateyInstall.ps1')
</pre>
</div>
</div>
</div>

<div id="outline-container-org094cbf5" class="outline-2">
<h2 id="org094cbf5">build.ps1</h2>
<div class="outline-text-2" id="text-org094cbf5">
<p>
This script does a few things for us. It will:
</p>

<ul class="org-ul">
<li>Download Chocolatey (v0.10.13) and extract it in a <code>temp</code> directory</li>
<li>Download and extract the 7-zip SFX module in a <code>temp</code> directory</li>
<li>Create the 7-zip archive <code>output\chocolateySetup.7z</code> containing Chocolatey,
<code>install.ps1</code> and <code>install.bat</code></li>
<li>And finally, create the executable <code>output/chocolateySetup.exe</code> by combining
<code>output/chocolateySetup.7z</code>, <code>config.txt</code> and the 7-zip SFX module</li>
</ul>

<p>
All calls to 7-zip are wrapped in an <code>exec</code> function, which I've described in a
<a href="/posts/2019-01-21-powershell-provision">previous post</a>.
</p>

<p>
You can tweak the <code>$chocoUrl</code> parameter to download a different version of
Chocolatey. Keep in mind that you might need to delete the <code>temp</code> directory to
remove all "cached" files.
</p>

<div class="org-src-container">
<pre class="src src-powershell">$ErrorActionPreference = 'Stop'
Set-StrictMode -Version 'Latest'

function exec {
    param(
        [Parameter(Mandatory = $true)]
        [scriptblock]$ScriptBlock,
        [int[]]$ValidExitCodes = @(0)
    )

    $global:LASTEXITCODE = 0

    &amp; $ScriptBlock

    if (-not ($global:LASTEXITCODE -in $ValidExitCodes)) {
        throw "Invalid exit code: $($global:LASTEXITCODE)"
    }
}

$root = if ($PSScriptRoot) { $PSScriptRoot } else { Split-Path -Path $psISE.CurrentFile.FullPath }

$configFile = Join-Path $root 'config.txt'
$chocoUrl = 'https://chocolatey.org/api/v2/package/chocolatey/0.10.13'
$lzmaUrl = 'https://www.7-zip.org/a/lzma1900.7z'

$outputDir = Join-Path $root 'output'
$tempDir = Join-Path $root 'temp'
$installerFile = Join-Path $outputDir 'chocolateySetup.exe'

if (Test-Path $outputDir) {
    Remove-Item $outputDir -Recurse -Force
}

New-Item $outputDir -Type Directory -Force | Out-Null
New-Item $tempDir -Type Directory -Force | Out-Null

$chocoDir = Join-Path $tempDir 'chocolatey'

if (-not (Test-Path $chocoDir)) {
    $chocoZipFile = Join-Path $tempDir 'chocolatey.zip'
    Invoke-WebRequest -Uri $chocoUrl -OutFile $chocoZipFile
    Expand-Archive -Path $chocoZipFile -DestinationPath $chocoDir
}

$sfxFileName = '7zS2.sfx'
$sfxFile = Join-Path $tempDir $sfxFileName

if (-not (Test-Path $sfxFile)) {
    $lzmaFile = Join-Path $tempDir 'lzma.7z'
    Invoke-WebRequest -Uri $lzmaUrl -OutFile $lzmaFile
    exec { 7z e $lzmaFile $sfxFileName -r -o"$tempDir" }
}

$installerZipFile = Join-Path $outputDir 'chocolateySetup.7z'

exec { 7z a $installerZipFile (Resolve-Path $chocoDir) }
exec { 7z a $installerZipFile 'install.bat' }
exec { 7z a $installerZipFile 'install.ps1' }

Get-Content $sfxFile, $configFile, $installerZipFile -Encoding Byte -Read 512 | Set-Content $installerFile -Encoding Byte
</pre>
</div>
</div>
</div>

<div id="outline-container-org403cc9a" class="outline-2">
<h2 id="org403cc9a">Usage</h2>
<div class="outline-text-2" id="text-org403cc9a">
<p>
Given the above files, call <code>build.ps1</code> to create <code>output\chocolateySetup.exe</code>.
Run the setup file, confirm the UAC prompt and the "Do you want to install Chocolatey?"
dialog to start the install process.
</p>

<p>
There's currently only one drawback that I'm aware of: After running the
installer, Windows might pop up a "This program might not have installed
correctly" message, even if the overall installation might be successful. Others
have reported similar problems on <a href="https://superuser.com/questions/730242/7zip-self-extracting-executables-require-admin-privileges-and-trigger-compatib">superuser</a> and <a href="https://stackoverflow.com/questions/9229581/how-to-do-vista-uac-aware-self-extract-installer">StackOverflow</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2019-09-27</p>
<footer>
<p>Copyright 2025, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
